InformationRegisters/ИА_ПодписиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ПодписиСотрудников</Name>
			<Comment>Образцы подписей сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ИА_ПечатьДолжностнойИнструкцииУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СписокСлов.Количество() = 0 Тогда
		ОбработатьИнструкции();
	Иначе
		ОбработатьОпределения();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьДанныеИнстуркции(Шаблон)
	
	Спр = Шаблон.ПолучитьОбъект();
	Д = Новый Структура("Текст, ТекстКолонтитула");
	ЗаполнитьЗначенияСвойств(Д, Спр);
	Возврат Д;

КонецФункции

&НаСервере
Функция ПолучитьШаблонПодписи()
	Возврат Константы.ИА_ДИ_ШаблонПодпись.Получить();
КонецФункции



&НаКлиенте
Процедура ОбработатьИнструкции()
	Если СокрЛП(Текст)="" Тогда
		возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьИнструкцииЗавершение", ЭтотОбъект), "Печатать подпись директора?",РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИнструкцииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		ПечатьПодписьДиректора = Истина;
	Иначе
		ПечатьПодписьДиректора = Ложь;
	КонецЕсли;
	
	
	Колонтитул = "";
	ПодписьДиректора = "";
	Если не Инструкция.Пустая() Тогда
		НовыйHTMLДокумент1 = Новый COMОбъект("HtmlFile");
		НовыйHTMLДокумент1.open("text/html");
		НовыйHTMLДокумент1.write(ПолучитьДанныеИнстуркции(Инструкция).ТекстКолонтитула);
		НовыйHTMLДокумент1.close();
		Колонтитул = СОКРЛП(НовыйHTMLДокумент1.body.innerHTML);
		
		ПодписьДиректора = ПолучитьШаблонПодписи();
		Если СокрЛП(ПодписьДиректора)<>"" Тогда
			НовыйHTMLДокумент1 = Новый COMОбъект("HtmlFile");
			НовыйHTMLДокумент1.open("text/html");
			НовыйHTMLДокумент1.write(ПодписьДиректора);
			НовыйHTMLДокумент1.close();
			ПодписьДиректора = СОКРЛП(НовыйHTMLДокумент1.body.innerHTML);
			
			ПараметрыПодписи = ПолучитьДанныеПодписанта(Инструкция);			
			
			ПодписьДиректора = СтрЗаменить(ПодписьДиректора, "%ФИО%", ПараметрыПодписи.ФИО);
			ПодписьДиректора = СтрЗаменить(ПодписьДиректора, "%Должность%", ПараметрыПодписи.Должность);
			
			Если ПечатьПодписьДиректора тогда
				ПодписьДиректора = СтрЗаменить(ПодписьДиректора, "%Подпись%", "<img style=""width:4cm; height: 4cm"" src=""data:image/jpeg;base64,"+ПараметрыПодписи.Подпись+"""");
			Иначе
				ПодписьДиректора = СтрЗаменить(ПодписьДиректора, "%Подпись%", "&nbsp;");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Текст2 = СтрЗаменить(Текст,"<META content=IE=9 http-equiv=X-UA-Compatible>","");
	Текст2 = СтрЗаменить(Текст2,"<META http-equiv=X-UA-Compatible content=IE=9>","");
	
	
	НовыйHTMLДокумент = Новый COMОбъект("HtmlFile");
	НовыйHTMLДокумент.open("text/html");
	НовыйHTMLДокумент.write(Текст2);
	
	
	ВнутрТекст = НовыйHTMLДокумент.body.innerHTML;
	
	счСтраниц = 1;
	позЛинии = Найти(ВнутрТекст, "1C_HR_TODEL");
	
	ВнутрТекст1 = "";
	Пока позЛинии>0 Цикл
		п1 = позЛинии;
		пока Сред(ВнутрТекст,п1,1) <> "<" Цикл
			п1 = п1 - 1;
		КонецЦикла;
		
		п2 = позЛинии;
		пока Сред(ВнутрТекст, п2, 1) <> ">" Цикл
			п2 = п2 + 1;
		КонецЦикла; 
		
		левЧасть = Лев(ВнутрТекст, п1-1);
		правЧасть = Сред(ВнутрТекст, п2+1);
		
		
		ВнутрТекст1 = ВнутрТекст1 + "<table width=""100%"" height=""100%"" border=0><tr width=""100%"" height=""99%""><td valign=top>"
		+левЧасть+"</td></tr>"+?(Колонтитул="","","<tr width=""100%"" height=""1%""><td>"
		+Колонтитул+"</td></tr>")+"<tr width=""100%"" height=""1%""><td align=center>-"+счСтраниц+"-</td></tr></table>";
		ВнутрТекст = правЧасть;
		//
		позЛинии = Найти(ВнутрТекст, "1C_HR");
		счСтраниц = счСтраниц + 1;
	КонецЦикла;
	
	ВнутрТекст1 = ВнутрТекст1 + "<table width=""100%"" height=""100%"" border=0><tr width=""100%"" height=""99%""><td valign=top>"
	+ВнутрТекст+"</td></tr>"+?(Колонтитул="","","<tr width=""100%"" height=""1%""><td>"
	+Колонтитул+"</td></tr>");
	
	ВнутрТекст1 = ВнутрТекст1 + "<tr width=""100%""><td>"+ПодписьДиректора+"</td></tr>";
	
	ВнутрТекст1 = ВнутрТекст1 + "<tr width=""100%"" height=""1%""><td align=center>-"+счСтраниц+"-</td></tr></table>";
	
	
	НовыйHTMLДокумент.body.innerHTML = ВнутрТекст1; 
	
	
	
	ИА_ДИ_КлиентСервер.УстановитьСтандартныйСтиль(НовыйHTMLДокумент, Ложь);
	
	НовыйHTMLДокумент.close();
	ПолеHTML = НовыйHTMLДокумент.all.tags("html").item(0).outerHTML;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОпределения()
	
	Если СписокСлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НовыйХТМЛ = "";
	СтруктураКартинок = Новый Структура;
	СчетчикКартинок = 0;
	Для каждого СловоИзСписка из СписокСлов Цикл
				
		ОпределениеТекст = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьДанныеОпределения(СловоИзСписка.Значение);
		
		Позиция = Найти(ОпределениеТекст, "<style type=""text/css"">");
		ТекТекст = "";
		
		Если Позиция = 0 Тогда
			ТекТекст = ВырезаемОбластьХТМЛ(ОпределениеТекст, "<body", "</body>");
			ТекТекст = ВставитьТекст(ТекТекст, "<br><p><b>" + СловоИзСписка.Значение + ":</b><p><br>", ">");
  		Иначе //innerHTML не работает если есть css
			ТекТекст = ВырезаемОбластьХТМЛ(ОпределениеТекст, "<style type=""text/css"">", "</body>");
			ТекТекст = ВставитьТекст(ТекТекст, "<br><p><b>" + СловоИзСписка.Значение + ":</b><p><br>", "</head>");
		КонецЕсли;
				
		НовыйХТМЛ = НовыйХТМЛ + ТекТекст;

		
	КонецЦикла;
	
	Шапка = "<html>
                 |<head>
                 |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
                 |<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
                 |<meta name=""format-detection"" content=""telephone=no"" />";
	Подвал = "</html>";
	ПолеHTML = Шапка + НовыйХТМЛ + Подвал;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВставитьТекст(Текст, Вставляемый, ПослеЧего)
	
	Позиция = Найти(Текст, ПослеЧего) + СтрДлина(ПослеЧего);
	Левая = Лев(Текст, Позиция - 1);
	Правая = Прав(Текст, СтрДлина(Текст) - Позиция + 1);
	
	Возврат Левая + Вставляемый + Правая;
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ВырезаемОбластьХТМЛ(Текст, Начало, Конец)
	ПозицияНачала = 0;
	ПозицияНачала1 = Найти(Текст, Начало);			
	ПозицияНачала2 = Найти(Текст, ВРег(Начало));
	ПозицияОкончания = 0;
	
	Если ПозицияНачала1 = 0 Тогда
		ПозицияНачала = ПозицияНачала2;
	ИначеЕсли ПозицияНачала2 = 0 Тогда
		ПозицияНачала = ПозицияНачала1;
	Иначе
		ПозицияНачала = Мин(ПозицияНачала1, ПозицияНачала2);
	КонецЕсли;	 		
		
	ТекСтр = Текст;
	
	Пока истина Цикл
		Поз = Макс(Найти(ТекСтр, Конец), Найти(ТекСтр, ВРег(Конец)));
		Если Поз = 0 Тогда
			Прервать;
		Иначе
			ПозицияОкончания = ПозицияОкончания + Поз;
		КонецЕсли;	
		ТекСтр = Прав(ТекСтр, СтрДлина(ТекСтр) - Поз - СтрДлина(Конец));
	КонецЦикла;
	
	Возврат Сред(Текст, ПозицияНачала, ПозицияОкончания - ПозицияНачала + СтрДлина(Конец));
	
КонецФункции
	

&НаСервере
Функция ПолучитьДанныеОпределение(Спр)
	Возврат Новый Структура("Наименование, Определение", Спр.Наименование, Спр.Определение);
КонецФункции


&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
	Элемент.Документ.Body.ContentEditable = "false";
	Элемент.Документ.body.scroll = "auto";
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	эл = ИА_ОбщиеПроцедуры_Технология.ИА_ПолучитьСсылкуOnClickПоляHTML(
		Неопределено, 
		Новый Структура("srcElement,returnValue",ДанныеСобытия.Element,Неопределено));
	Если не эл.Пустая() Тогда
		ПоказатьЗначение(,эл);
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПодписанта(Инструкция)
	// возращает структуру ФИО, Подпись, Должность
	Результат = Новый Структура("ФИО, Подпись, Должность");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ПодписиСотрудников.Должность,
		|	ИА_ПодписиСотрудников.ФИО,
		|	ИА_ПодписиСотрудников.Подпись
		|ИЗ
		|	РегистрСведений.ИА_ПодписиСотрудников КАК ИА_ПодписиСотрудников
		|ГДЕ
		|	ИА_ПодписиСотрудников.Сотрудник = &Сотрудник";

	Запрос.УстановитьПараметр("Сотрудник", Инструкция.Подписант);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат.ФИО = ВыборкаДетальныеЗаписи.ФИО;
		Результат.Должность = ВыборкаДетальныеЗаписи.Должность;
		Результат.Подпись = Base64Строка(ВыборкаДетальныеЗаписи.Подпись.Получить());
	Иначе
		Сообщить("Не найдены параметры подписи подписанта.")
		
	КонецЕсли;
	
	Возврат  Результат;
 	
КонецФункции

&НаКлиенте
Процедура КомандаПечать(Команда)
	Элементы.ПолеHTML.Документ.parentWindow.Print();
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьВложенияОпределения(Определение)
  Возврат Справочники.ИА_Определения.ПолучитьВложенияОпределения(Определение);
КонецФункции
